vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC242_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXC242_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXC242_cmsis</description>
      <files>
        <file category="header" name="devices/MCXC242/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXC242/MCXC242.h" projectpath="device"/>
        <file category="header" name="devices/MCXC242/MCXC242_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXC242/MCXC242_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_ADC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_CMP.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_CRC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_DMA.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_DMAMUX.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_FGPIO.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_FLEXIO.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_FTFA.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_GPIO.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_I2C.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_LLWU.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_LPTMR.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_LPUART.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_MCG.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_MCM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_MTB.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_MTBDWT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_NV.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_OSC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_PIT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_PMC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_PORT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_RCM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_RFSYS.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_ROM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_RTC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_SIM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_SMC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_SPI.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_TPM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_UART.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_USB.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXC242/periph1/PERI_VREF.h" projectpath="device/periph1"/>
        <file category="include" name="devices/MCXC242/"/>
        <file category="include" name="devices/MCXC242/periph1/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXC242/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXC242/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXC242_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXC242_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC242.condition_id" category="linkerScript" attr="config" name="devices/MCXC242/arm/MCXC242_flash.scf" version="1.0.0" projectpath="MCXC242/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC242.condition_id" category="linkerScript" attr="config" name="devices/MCXC242/arm/MCXC242_ram.scf" version="1.0.0" projectpath="MCXC242/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC242.condition_id" category="linkerScript" attr="config" name="devices/MCXC242/gcc/MCXC242_flash.ld" version="1.0.0" projectpath="MCXC242/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC242.condition_id" category="linkerScript" attr="config" name="devices/MCXC242/gcc/MCXC242_ram.ld" version="1.0.0" projectpath="MCXC242/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC242.condition_id" category="linkerScript" attr="config" name="devices/MCXC242/iar/MCXC242_flash.icf" version="1.0.0" projectpath="MCXC242/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC242.condition_id" category="linkerScript" attr="config" name="devices/MCXC242/iar/MCXC242_ram.icf" version="1.0.0" projectpath="MCXC242/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXC242" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXC242</description>
      <files>
        <file category="header" attr="config" name="devices/MCXC242/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC242/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC242/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC242/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC242/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC242/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC242/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC242/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXC242/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXC242_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MCXC242/iar/startup_MCXC242.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MCXC242/gcc/startup_MCXC242.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MCXC242/arm/startup_MCXC242.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
